# Road_GetStationPoint

## Description
Return 3D point of the station that is related with the Roadway (Poly) object.

```pascal
PROCEDURE Road_GetStationPoint(
				hRoadwayObject : HANDLE;
				index          : LONGINT;
				VAR RETURN     : REAL);
```

```python
def vs.Road_GetStationPoint(hRoadwayObject, index):
    return RETURN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hRoadwayObject|HANDLE|   |
|index|LONGINT|   |
|RETURN|REAL|   |

## Version
Availability: from Vectorworks 2015

## Category
* Roadway Interface Library